Repository: Trickery710/ubuntu-wsl-splash
Catalog: lib/l10n/app_*.arb
Languages: pt_br, ro

# appTitle
source: What to expect from Ubuntu on WSL
pt_br: O que esperar do Ubuntu no WSL
ro: La ce să te aștepți de la Ubuntu pe WSL

# windowTitle
source: Installing Ubuntu on WSL
pt_br: Instalando o Ubuntu no WSL
ro: Instalare Ubuntu pe WSL

# welcome
source: Welcome to Ubuntu WSL
pt_br: Bem-vindo ao Ubuntu WSL
ro: Bun venit la Ubuntu pe WSL

source: Initializing...
pt_br: Inicializando...
ro: Se inițializează...

# unpacking
source: Unpacking the distro
pt_br: Descompactando a distro
ro: Se despachetează distro-ul

# installing
source: Almost done. The installer will require your attention soon.
pt_br: Quase pronto. O instalador irá solicitar sua atenção em breve.
ro: Aproape gata. Instalatorul va necesita atenția ta curând.

# launching
source: Launching distro...
pt_br: Iniciando a distro...
ro: Se pornește distro-ul...

# errorMsg
source: Something went wrong.
pt_br: Algo deu errado.
ro: Ceva nu a mers.

# errorSub
source: Please restart WSL with the following command and try again: wsl --shutdown wsl --unregister DISTRO_NAME
pt_br: Por favor reinicie o WSL com os seguintes comandos e tente novamente: wsl --shutdown wsl --unregister DISTRO_NAME
ro: Te rugăm să restartezi WSL utilizând următoarea comandă, apoi reîncearcă: wsl --shutdown wsl --unregister NUME_DISTRO

# done
source: All set. Enjoy using Ubuntu on WSL
pt_br: Tudo certo. Curta o Ubuntu no WSL
ro: Am terminat. Spor la utilizarea Ubuntu pe WSL

# exitTitle
source: Are you sure you want to leave?
pt_br: Tem certeza que quer sair?
ro: Ești sigur că dorești să renunți?

# exitContents
source: Closing this window will not prevent the installation from continuing in the background. Besides, you can continue exploring what you can do with Ubuntu on WSL.
pt_br: Fechar esta janela não vai impedir a instalação de prosseguir em segundo plano. \nAlém disso, você pode continuar explorando o que poderá fazer com o Ubuntu no WSL.
ro: Instalarea va continua în fundal chiar și după ce închizi această fereastră. În plus, poți continua să explorezi ce vei putea realiza cu Ubuntu pe WSL.

# customExitTitle
source: We are almost done
pt_br: Estamos quase lá
ro: Aproape am terminat

# customExitContents
source: Just a few steps to be completed in the main installer window. Can we quit this one and go there?
pt_br: Apenas mais alguns passos a ser completados na janela principal do instalador. Podemos encerrar esta e mudar para lá?
ro: Mai sunt câțiva pași de completat în fereastra principală de instalare. Putem închide fereastra asta și să continuăm acolo?

source: Leave
pt_br: Sair
ro: Renunță

source: Cancel
pt_br: Cancelar
ro: Anulează

source: Ubuntu on WSL
pt_br: Ubuntu no WSL
ro: Ubuntu pe WSL

# ubuntuOnWslText
source: WSL delivers the full Ubuntu terminal environment to develop cross-platform applications and manage IT infrastructure without leaving Windows.
pt_br: Um ambiente Ubuntu completo, fortemente integrado ao Windows, para desenvolvimento e execução de aplicações Linux. Otimizado para nuvem, web, data science, IOT e diversão!
ro: Un mediu Ubuntu complet, adânc integrat cu Windows, pentru dezvoltarea și execuția aplicațiilor de Linux. Optimizat pentru cloud, web, știința datelor, IOT, și distracție!

# ubuntuWslWebDev
source: Ubuntu WSL for Web Development
pt_br: Ubuntu WSL para Desenvolvimento Web
ro: Ubuntu WSL pentru Dezvoltare Web

# ubuntuWslWebDevText
source: Develop in WSL using native Windows IDEs including VS Code and IntelliJ and benefit from full NodeJS and Ruby support.
pt_br: Desenvolva no WSL usando IDEs nativos do Windows incluindo VS Code e IntelliJ e se beneficie de suporte completo ao NodeJS e Ruby.
ro: Dezvoltă în WSL utilizând IDE-uri native Windows, incluzând VS Code și IntelliJ, și beneficiază de suport complet pentru NodeJS și Ruby.

# ubuntuWslDataScience
source: Ubuntu WSL for Data Science
pt_br: Ubuntu WSL para Data Science
ro: Ubuntu WSL pentru Știința Datelor

# ubuntuWslDataScienceText
source: NVIDIA Data Science Stack lets you maximize the performance of Data Science and Machine Learning projects on top of native Windows NVIDIA drivers.
pt_br: NVIDIA Data Science Stack permite maximizar a performance dos seus projetos de Data Science e Machine Learning em cima dos drivers nativos NVIDIA para Windows.
ro: NVIDIA Data Science Stack îți permite să maximizezi performanța proiectelor de Data Science și Machine Learning alături de driverele native Windows NVIDIA.

# ubuntuWslGuiApps
source: Ubuntu WSL for Graphical Apps
pt_br: Ubuntu WSL para Apps Gráficos
ro: Ubuntu WSL pentru Aplicații Grafice

# ubuntuWslGuiAppsText
source: Develop and preview web and graphical applications on Linux using WSLg for multi-platform development.
pt_br: Desenvolva e visualize applicações web e gráficas no Linux usando o WSLg para desenvolvimento multiplataforma.
ro: Dezvoltă și previzualizează aplicații web și grafice pe Linux folosind WSLg pentru o experiență multi-platformă.

# ubuntuWslDevOps
source: Ubuntu WSL for DevOps
pt_br: Ubuntu WSL para DevOps
ro: Ubuntu WSL pentru DevOps

# ubuntuWslDevOpsText
source: Ensure CI/CD pipeline compatibility by developing on Ubuntu WSL locally before publishing to an Ubuntu production environment
pt_br: Assegure compatibilidade com os pipelines de CI/CD desenvolvendo no Ubuntu WSL localmente antes de publicar para o ambiente de produção Ubuntu.
ro: Asigură compatibilitatea sistemelor de CI/CD prin dezvoltarea locală pe Ubuntu WSL, înaintea publicării într-un mediu Ubuntu de producție

# ubuntuWslEnterprises
source: Ubuntu WSL for Enterprises
pt_br: Ubuntu WSL para Empresas
ro: Ubuntu WSL pentru Întreprinderi

# ubuntuWslEnterprisesText
source: Empower developers in a Windows enterprise ecosystem with a certified Ubuntu LTS.
pt_br: Empodere desenvolvedores em um ambiente Windows corporativo com um Ubuntu LTS certificado.
ro: Încurajează dezvoltatorii dintr-un ecosistem Windows enterprise printr-un Ubuntu LTS certificat.

source: Find out more
pt_br: Saiba mais
ro: Află mai mult

# findOutMoreVisit
source: Visit
pt_br: Visite
ro: Vizitează

# findOutMoreText
source: to find out more about Ubuntu on WSL and how Canonical supports developers and organisations.
pt_br: para saber mais sobre o Ubuntu no WSL e como a Canonical fornece suporte a desenvolvedores e organizações.
ro: pentru a afla mai multe despre Ubuntu pe WSL și cum susține Canonical dezvoltatorii și organizațiile.
